In [4]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

print("all set up ðŸ˜Ž")

all set up ðŸ˜Ž

In [5]:
### Filter and Data Selection

In [12]:
my_obj = Series(np.arange(8), index=["row 1", "row 2","row 3","row 4","row 5","row 6","row 7","row 8" ])
my_obj

row 1    0
row 2    1
row 3    2
row 4    3
row 5    4
row 6    5
row 7    6
row 8    7
dtype: int64

In [14]:
my_obj["row 8"]

7

In [28]:
myFrame = DataFrame(np.random.rand(36).reshape((6,6)), index=['row 1','row 2','row 3','row 4','row 5','row 6'])
myFrame

              0         1         2         3         4         5
row 1  0.085703  0.747596  0.183010  0.015087  0.913751  0.925941
row 2  0.582870  0.312620  0.998268  0.150014  0.994481  0.124964
row 3  0.351055  0.531058  0.323604  0.806417  0.960319  0.539474
row 4  0.499325  0.801124  0.797099  0.119866  0.245986  0.626783
row 5  0.377250  0.063457  0.373199  0.074116  0.044442  0.293012
row 6  0.754543  0.953247  0.588749  0.987940  0.198074  0.042969

In [26]:
### Data Slicing
my_obj["row 3": "row 6"]

row 3    2
row 4    3
row 5    4
row 6    5
dtype: int64

In [29]:
### comparing with scalars
myFrame < .2

           0      1      2      3      4      5
row 1   True  False   True   True  False  False
row 2  False  False  False   True  False   True
row 3  False  False  False  False  False  False
row 4  False  False  False   True  False  False
row 5  False   True  False   True   True  False
row 6  False  False  False  False   True   True

In [31]:
### Filtering with scalars
my_obj[my_obj > 6] # give me all rows that have a value greater than 6

row 8    7
dtype: int64

In [33]:
### setting values with scalars 
my_obj['row 1', 'row 5', 'row 8'] = 8
my_obj

row 1    8
row 2    1
row 3    2
row 4    3
row 5    8
row 6    5
row 7    6
row 8    8
dtype: int64

<h2>Treating Missing Values</h2>

In [36]:
### figuring out what data is missing
missing = np.nan
series_obj = Series(["row 1", "row 2", missing, "row 3", "row 4", "row 5", "row 6", missing, "row 8"])
series_obj

0    row 1
1    row 2
2      NaN
3    row 3
4    row 4
5    row 5
6    row 6
7      NaN
8    row 8
dtype: object

In [37]:
### using isNull method to return a series of boolen values to determine 
###which values are null (true) and whch are available (false)

series_obj.isnull()

0    False
1    False
2     True
3    False
4    False
5    False
6    False
7     True
8    False
dtype: bool

In [42]:
### Filling in for missing values
np.random.seed(25)
df_obj = DataFrame(np.random.randn(36).reshape(6,6))
df_obj.iloc[3:5, 0] = missing
df_obj.iloc[1:4, 5] = missing
df_obj

          0         1         2         3         4         5
0  0.228273  1.026890 -0.839585 -0.591182 -0.956888 -0.222326
1 -0.619915  1.837905 -2.053231  0.868583 -0.920734       NaN
2  2.152957 -1.334661  0.076380 -1.246089  1.202272       NaN
3       NaN -0.419678  2.294842 -2.594487  2.822756       NaN
4       NaN -1.976254  0.533340 -0.290870 -0.513520  1.982626
5  0.226001 -1.839905  1.607671  0.388292  0.399732  0.405477

In [43]:
### fillna finds all values that are missing and fills in with whatever values you provide
fill_df = df_obj.fillna(0)
fill_df

          0         1         2         3         4         5
0  0.228273  1.026890 -0.839585 -0.591182 -0.956888 -0.222326
1 -0.619915  1.837905 -2.053231  0.868583 -0.920734  0.000000
2  2.152957 -1.334661  0.076380 -1.246089  1.202272  0.000000
3  0.000000 -0.419678  2.294842 -2.594487  2.822756  0.000000
4  0.000000 -1.976254  0.533340 -0.290870 -0.513520  1.982626
5  0.226001 -1.839905  1.607671  0.388292  0.399732  0.405477

In [44]:
### to fill in each columns values with their own unique value you can pass a dictionary into the method
fill_df = df_obj.fillna({0:99999, 5:99999 })
fill_df

              0         1         2         3         4             5
0      0.228273  1.026890 -0.839585 -0.591182 -0.956888     -0.222326
1     -0.619915  1.837905 -2.053231  0.868583 -0.920734  99999.000000
2      2.152957 -1.334661  0.076380 -1.246089  1.202272  99999.000000
3  99999.000000 -0.419678  2.294842 -2.594487  2.822756  99999.000000
4  99999.000000 -1.976254  0.533340 -0.290870 -0.513520      1.982626
5      0.226001 -1.839905  1.607671  0.388292  0.399732      0.405477

In [46]:
###using fill forward method fills in missing data with the previous value encountered
fill_df = df_obj.fillna(method="ffill")
fill_df

          0         1         2         3         4         5
0  0.228273  1.026890 -0.839585 -0.591182 -0.956888 -0.222326
1 -0.619915  1.837905 -2.053231  0.868583 -0.920734 -0.222326
2  2.152957 -1.334661  0.076380 -1.246089  1.202272 -0.222326
3  2.152957 -0.419678  2.294842 -2.594487  2.822756 -0.222326
4  2.152957 -1.976254  0.533340 -0.290870 -0.513520  1.982626
5  0.226001 -1.839905  1.607671  0.388292  0.399732  0.405477